In [11]:
import numpy as np
import pandas as pd

In [14]:
data= {'Company': ['FB', 'FB', 'GOOG', 'GOOG', 'MSFT', 'MSFT'],
    'Person' : ['Malik','Ali','Nawab','Khan','Bangash','Pathan'],
    'Sales'  : [200,300, 400, 500, 600, 700]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

  Company   Person  Sales
0      FB    Malik    200
1      FB      Ali    300
2    GOOG    Nawab    400
3    GOOG     Khan    500
4    MSFT  Bangash    600
5    MSFT   Pathan    700

In [19]:
byComp = df.groupby('Company')

In [21]:
byComp.mean() # person is not allowed because it is string and con't take mean of strings.

         Sales
Company
FB       250.0
GOOG     450.0
MSFT     650.0

In [22]:
byComp.sum()

         Sales
Company
FB         500
GOOG       900
MSFT      1300

In [23]:
byComp.std() # Standard Deviation.

             Sales
Company
FB       70.710678
GOOG     70.710678
MSFT     70.710678

In [24]:
df.groupby('Company').sum().loc['FB'] # WE CAN WRITE IT IN A SINGLE LINE.

Sales    500
Name: FB, dtype: int64

In [25]:
byComp.min()

          Person  Sales
Company
FB           Ali    200
GOOG        Khan    400
MSFT     Bangash    600

In [26]:
byComp.max()

         Person  Sales
Company
FB        Malik    300
GOOG      Nawab    500
MSFT     Pathan    700

In [27]:
byComp.describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
GOOG      2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
MSFT      2.0  650.0  70.710678  600.0  625.0  650.0  675.0  700.0

In [28]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   250.000000  450.000000  650.000000
      std     70.710678   70.710678   70.710678
      min    200.000000  400.000000  600.000000
      25%    225.000000  425.000000  625.000000
      50%    250.000000  450.000000  650.000000
      75%    275.000000  475.000000  675.000000
      max    300.000000  500.000000  700.000000